In [1]:
# coding=utf-8

import pandas as pd
import numpy

user_age = pd.Series(data = [18, 30, 25, 40])
#print(user_age)

user_age.index.name = "name"

#print(user_age)

user_age.name = "user_age_info"=
#print(user_age)

name = pd.Index(['Tom', 'Bob', ])

#构建索引
name = pd.Index(["Tom", "Bob", "Mary", "Jame"], name = "name")
#构造Series
user_age = pd.Series(data = [18, 30, 25, 40], index = name, name = "user_age_info")

In [2]:
name

Index(['Tom', 'Bob', 'Mary', 'Jame'], dtype='object', name='name')

In [3]:
user_age = pd.Series(data = [18, 30, 25, 40], index = name, name = "user_age_info", dtype = float)

In [4]:
user_age

name
Tom     18.0
Bob     30.0
Mary    25.0
Jame    40.0
Name: user_age_info, dtype: float64

In [5]:
user_age.get('Bob')

30.0

user_age[:3]

In [7]:
import matplotlib

In [8]:
user_age[user_age > 30]

name
Jame    40.0
Name: user_age_info, dtype: float64

In [9]:
user_age[[3, 1]]

name
Jame    40.0
Bob     30.0
Name: user_age_info, dtype: float64

In [10]:
#与ndarray和相同 支持向量化操作

In [11]:
user_age + 1

name
Tom     19.0
Bob     31.0
Mary    26.0
Jame    41.0
Name: user_age_info, dtype: float64

In [14]:
import numpy as np
np.exp(user_age)

name
Tom     6.565997e+07
Bob     1.068647e+13
Mary    7.200490e+10
Jame    2.353853e+17
Name: user_age_info, dtype: float64

In [ ]:
index = pd.Index(data = ['Tom', 'Bob', 'Marry', 'James'])

In [29]:
index = pd.Index(data = ['Tom', 'Bob', 'Marry', 'James'], name = 'name')
data = {'age': [18, 30, 25, 40],
'City': ['Beijing', 'ShangHai', 'GuangZhou', 'ShenZhen']}
frame = pd.DataFrame(data = data, index = index)

In [30]:
frame

       age       City
name
Tom     18    Beijing
Bob     30   ShangHai
Marry   25  GuangZhou
James   40   ShenZhen

In [36]:
data = [[18, 'Beijing'], [30, 'Shanghai'], [25, 'GuangZhou'], [40, 'ShenZhen']]
columns = ['age', 'city']

In [38]:
user_info = pd.DataFrame(data = data, index = index, columns = columns)

In [39]:
user_info

       age       city
name
Tom     18    Beijing
Bob     30   Shanghai
Marry   25  GuangZhou
James   40   ShenZhen

In [40]:
user_info.loc['Tom']

age          18
city    Beijing
Name: Tom, dtype: object

In [42]:
user_info.iloc[0]

age          18
city    Beijing
Name: Tom, dtype: object

In [43]:
#访问多行

In [44]:
user_info.iloc[1:3]

       age       city
name
Bob     30   Shanghai
Marry   25  GuangZhou

In [45]:
user_info.age

name
Tom      18
Bob      30
Marry    25
James    40
Name: age, dtype: int64

In [47]:
user_info['age']

name
Tom      18
Bob      30
Marry    25
James    40
Name: age, dtype: int64

In [49]:
user_info[['city', 'age']]

            city  age
name
Tom      Beijing   18
Bob     Shanghai   30
Marry  GuangZhou   25
James   ShenZhen   40

In [50]:
user_info['sex'] = 'Male'
user_info

       age       city   sex
name
Tom     18    Beijing  Male
Bob     30   Shanghai  Male
Marry   25  GuangZhou  Male
James   40   ShenZhen  Male

In [51]:
#如果想要删除一列，可以用pop方法来完成

In [52]:
user_info.pop('sex')

name
Tom      Male
Bob      Male
Marry    Male
James    Male
Name: sex, dtype: object

In [53]:
user_info

       age       city
name
Tom     18    Beijing
Bob     30   Shanghai
Marry   25  GuangZhou
James   40   ShenZhen

In [59]:
#如果性别不一致的时候，可以通过传入一个like-list来添加新的一列

In [60]:
user_info['sex'] = ['male', 'male', 'female', 'male']

In [61]:
user_info

       age       city     sex
name
Tom     18    Beijing    male
Bob     30   Shanghai    male
Marry   25  GuangZhou  female
James   40   ShenZhen    male